package sea_battle;

import java.util.Map;
import java.util.Set;
//
public class Player1 extends Player {

    public Player1(FillCharacters[][] battlefield, FillCharacters[][] arrayStrike,
                   String playerName, Map<Point, FillCharacters> pointsMap,
                   Set<Point> strikingSet, Set<Point> shipLocationSet) {
        super(battlefield, arrayStrike, playerName, pointsMap, strikingSet,
                shipLocationSet);
    }
}
/*
 неисправности:
   - если в условие цикла while написать (countOfAllDecks != 0) , то
   при внесени нескольких координат, последняя не вносится вместе со всеми
   если условие меняю на (scanner.hasNextLine()), тоже при внесении нескольких координат
   последняя не вносится, если не добавить лишнюю строчку(у меня ".")

   - проверка на то, попадает ли корабль в зону ареола др. корабля, производиться только при постановке первой палубы(на первой итерации цикла).
   - нет связи между палубами. Многопалубный корабль не индефицируется как одно целое.
   - не проявляется ореол при уничтожении корабля


                          Player 1
  Sea                *   *   *   *   *
  Battle    .0.|.1.|.2.|.3.|.4.|.5.|.6.|.7.|.8.|.9.

  |.0.|     .-. 0,1;0,2;0,3;0,4 .-. .-. 0,7;0,8;0,9
  |.1.|     .-. .-. .-. .-. .-. .-. .-. .-. .-. .-.
  |.2.|     2,0 .-. 2,2;2,3;2,4 .-. .-. 2,7 .-. 2,9
  |.3.|     .-. .-. .-. .-. .-. .-. .-. .-. .-. .-.
  |.4.|     .-. .-. .-. .-. .-. .-. .-. .-. .-. .-.
  |.5.|     .-. .-. .-. .-. .-. .-. .-. .-. .-. .-.
  |.6.|     6,0;6,1 .-. .-. .-. .-. .-. 6,7;6,8 .-.
  |.7.|     .-. .-. .-. .-. .-. .-. .-. .-. .-. .-.
  |.8.|     .-. 8,1 .-. .-. .-. .-. .-. .-. .-. .-.
  |.9.|     .-. .-. .-. 9,3;9,4 .-. .-. .-. .-. .-.


   Для расстановки кораблей:

   0,1;0,2;0,3;0,4
   0,7;0,8;0,9
   2,2;2,3;2,4
   6,0;6,1
   9,3;9,4
   6,7;6,8
   2,0
   2,7
   2,9
   8,1
   .

Координаты для ударов:
0,1
0,2
0,3
0,4
0,7
0,8
0,9
2,2
2,3
2,4
6,0
6,1
9,3
9,4
6,7
6,8
2,0
2,7
2,9
8,1
.


                          Player 1
  Sea                *   *   *   *   *
  Battle   |.0.|.1.|.2.|.3.|.4.|.5.|.6.|.7.|.8.|.9.|

  |.0.|     .-. 0,1;0,2;0,3;0,4  -   -  0;7;0,8;0,9
  |.1.|      -   -   -   -   -   -   -   -   -   -
  |.2.|     2,0  -  2,2;2,3;2,4  -   -  2,7  -  2,9
  |.3.|      -   -   -   -   -   -   -   -   -   -
  |.4.|     .-. .-. .-.  *  .-. .-. .-. .-. .-. .-.
  |.5.|      -   -   -   *  .-. .-.  -   -   -   -
  |.6.|     6,0;.#.  *  .-. .-. .-.  -  6,7;6,8  -
  |.7.|      -   -   -  .-. .-. .-.  -   -   -   -
  |.8.|      -  8,1  -   -   -   -  .-. .-. .-. .-.
  |.9.|      -   -   -  9,3;9,4  -  .-. .-. .-. .-.


                          Player 1
  Sea                *   *   *   *   *
  Battle   |.0.|.1.|.2.|.3.|.4.|.5.|.6.|.7.|.8.|.9.|

  |.0.|     0,0;0,0;0,0;0,0  -  .-.  -  0,0;0,0;0,0
  |.1.|      -   -   -   -   -   -   -   -   -   -
  |.2.|     0,0  -  .#. .#. .#.  -   -  0,0  -  0,0
  |.3.|      -   -   -   -   -   *   -   -   -   -
  |.4.|     .-. .-. .-. .-. .-.  *  .-. .-. .-. .-.
  |.5.|      -   -   -  .-. .-. .-.  -   -   -   -
  |.6.|     0,0;0,0  -  .-. .-. .-.  -  0,0;0,0  -
  |.7.|      -   -   -  .-. .-. .-.  -   -   -   -
  |.8.|      -  0,0  -   -   -   -  .-. .-. .-. .-.
  |.9.|      -   -   -  0,0;0,0  -  .-. .-. .-. .-.

 */